app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @contact = Contact.find(params[:id])

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("created_at", "email", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 13 Aug 2013 13:22:28 UTC +00:00], ["email", ""], ["name", ""], ["phone", ""], ["updated_at", Tue, 13 Aug 2013 13:22:28 UTC +00:00]]
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 1]]
---
  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy